{
        "navigation":["Home","About Me","Skills","Projects","Contact","Imprint","Data-Protection"],
        
        "heroSection":{
                "headline": "Web & App\nDeveloper",
                "button": "More about me!",
                "text" :"With Angular and Django, I bring my projects to life. Programming has long since become more than just a hobby.",
                "prefixText" : "Hi I'am Marcel Arndt"
        },
        "toast":{
                "emailSuccessful" : "Email could be sent successfully.",
                "emailError" : "Ops! Something went wrong, Email could not be sent."
        },

        "skills":{       
                "headline": "My Skills",
                "text": "Are you missing a specific technology in my stack?\nI'm open to new tools and a fast learner.",
                "prefixText": "These are",
                "button": "Send a Message"
        },       

        "contact": {        
                "headline": "Contact",
                "text": "Feel free to contact me if you need support with your web project or have any questions.\n\nI’m looking forward to your message.",
                "prefixText": "Just get in",
                "button": "Send me an email at",
                "formHeadline": "Send me a message",
                "formName": "Full name *",
                "formEmail": "Your email *",
                "formIdea": "Tell me more about your ideas",
                "formText": "Your message *",
                "formErrorName": "Please enter a valid name.",
                "formErrorMail": "Please enter a valid email address.",
                "formErrorText": "Please enter a message.",
                "formErrorDataProtection": "Please check the Checkbox at data protection.",
                "formErrorButton": "Send Message"
        },

        "about_me": {
                "prefixheadline": "What you should know",
                "headline": "About me",
                "textAboutMe": "I'm Marcel Arndt and I live near Bielefeld. I enjoy developing web apps that make ideas tangible and make everyday life easier for people. Programming, to me, means creating something of my own from small building blocks together with a touch of creativity.",
                "textInterests": "Cooking and programming have a lot in common: both require preparation, curiosity, and a sense for the right mix. In the kitchen, as in code, I express my independence by creating something that works, brings joy, and does good for others.",
                "textGoals": "I want to use my work to help people gain access to and use digital tools. My goal is to develop software that encourages independence, creativity, and the freedom to 'let them cook'.",
                "buttonAboutMe": "I'm Marcel",
                "buttonInterests": "My Interests",
                "buttonGoals": "My Goals"
        },

        "portfolio":{
                "prefixheadline": "Take a look at my",
                "text": "A selection of projects that reflect my journey and passion for web development."
        },

        "projectOne": {
                "prefixheadline": "Write me at",
                "headline": "DABubble",
                "projectText": "DABubble is a real-time chat web application inspired by platforms like Slack or Discord. Users can join groups and chat together in different channels.\n\nMy main task in this project was to implement the entire login and registration process. For that, I worked extensively with Firebase and its comprehensive documentation. The result: users can either sign in with their Google account or create their own account – including secure data verification and communication with the Firebase API.\n\nThroughout the project, I was also able to deepen my understanding of Angular. One particularly interesting aspect was comparing template-driven forms and reactive forms. In the end, I chose the reactive approach because it offers more flexibility – for example, when adding custom validators or working with asynchronous data.\n\nFinally, I refined the user experience with smooth animations. When navigating through the registration process, the windows slide gently in the corresponding direction, making the flow feel more natural and user-friendly.",
                "moreButton": "read more...",
                "picture": "./assets/projects/project_three.jpg",
                "pictureSmall": "./assets/projects/project_one-mobil.jpg",
                "colorHSL": [30, 87, 60],
                "technology": ["angular", "firebase", "sass"],
                "demoLink": "https://arndt-marcel.de/dabubble",
                "gitHubLink": "https://github.com/MarcelArndt/DABubble"
        },

        "projectTwo": {
                "prefixheadline": "Manage your Task in",
                "headline": "Join",
                "projectText": "Join is a self-developed Kanban board system that allows tasks and contacts to be managed efficiently. The project was built entirely in vanilla JavaScript — without any frameworks or libraries — and was one of my biggest challenges so far.\n\nMy main task was to develop the board itself, including the layout, interaction logic, and data handling. Surprisingly, the most difficult parts weren’t implementing the drag-and-drop or touch functionality, but rather updating the user interf",
                "moreButton": "read more...",
                "picture": "./assets/projects/project_two.jpg",
                "pictureSmall": "./assets/projects/project_two-mobil.jpg",
                "colorHSL": [230, 93, 60],
                "technology": ["javascript", "html", "css"],
                "demoLink": "https://arndt-marcel.de/join/",
                "gitHubLink": "https://github.com/MarcelArndt/Project-Join"
        },

        "projectThree": {
                "prefixheadline": "Watch it first on",
                "headline": "Videoflix",
                "projectText": "Videoflix is a streaming or media library clone which is similar to Netflix or Jellyfin. Users can not only watch and stream their own videos but also upload them directly through the web interface. The server automatically converts uploaded files into streamable formats.\nIt was important to me that the platform could be fully managed through the frontend, without having to manually add content via the backend\n\nHowever, getting there wasn't easy.\nVideoflix confronted me with numerous challenges. From handling large datasets with PostgreSQL, integrating Simple JWT and HTTPS cookies, to diving deep into the inner workings of Django. It was tough, it was long. But ultimately more thrilling than any documentary about the Mariana Trench.\n\nIn the end, the project turned out to be something I'm truly proud of:\nI learned to use Docker for deployment, implemented Redis for caching, built a complete authentication system, and combined several modern technologies into one cohesive platform.\n\n",
                "moreButton": "read more...",
                "picture": "./assets/projects/project_one.png",
                "colorHSL": [270, 85, 60],
                "technology": ["angular", "django", "docker"],
                "demoLink": "https://videoflix.arndt-dev.de/",
                "gitHubLink": "https://github.com/MarcelArndt/Videoflix-Frontend"
        }
}