{
        "navigation":["Startseite","Über Mich","Skills","Projekte","Kontakt","Impressum","Datenschutz"],
        
        "heroSection":{
                "headline": "Web & App\nEntwickler",
                "button": "Mehr über mich!",
                "text" :"Mit Angular und Django setze ich meine Projekte in die Realität um. Dabei ist Programmieren längst mehr geworden als nur ein Hobby.",
                "prefixText" : "Hi, ich bin Marcel Arndt"
        },

        "toast":{
                "emailSuccessful" : "E-Mail konnte erfolgreich versendet werden",
                "emailError" : "Ops! Email konnte nicht versendet werden."
        },
        "skills":{        
                "headline": "Meine Skills",
                "text": "Du vermisst eine bestimmte Technologie in meinem Stack?\nIch bin offen für neue Tools und lerne schnell dazu.",
                "prefixText": "Dies sind",
                "button": "Schreib mir"
        },

        "contact":{        
                "headline": "Kontakt",
                "text": "Kontaktiere mich gern, wenn du Unterstützung bei deinem Webprojekt brauchst oder Fragen hast.\n\nIch freue mich auf deine Nachricht.",
                "prefixText": "Komm mit mir in",
                "button": "Sende eine E-mail an",
                "formHeadline": "Send mir eine Nachricht",
                "formName": "Kompletter Name *",
                "formEmail": "Deine Email *",
                "formIdea": "Erzähl mir mehr über deine Ideen",
                "formText": "Deine Nachricht *",
                "formErrorName": "Bitte gib einen gültigen Namen ein.",
                "formErrorMail": "Bitte gib eine gültige E-Mail ein.",
                "formErrorText": "Bitte gib eine Nachricht ein.",
                "formErrorDataProtection": "Bitte überprüfe das Häckchen bei Datenschutz.",
                "formErrorButton": "Nachricht senden"
         },  

        "about_me":{
                "prefixheadline": "Was muss man wissen",
                "headline": "Über mich",
                "textAboutMe" : "Ich bin Marcel Arndt und komme aus der Nähe von Bielefeld. Ich entwickle gerne Web-Apps, die Ideen greifbar machen und Menschen den Alltag erleichtern. Programmieren bedeutet für mich, dass ich aus kleinen Bausteinen etwas Eigenes erschaffen mit einer Prise Kreativität.",
                "textInterests" : "Kochen und Programmieren haben viel gemeinsam: Beide verlangen Vorbereitung, Experimentierfreude und ein Gefühl für das richtige Zusammenspiel. In der Küche wie im Code bringe ich meine Unabhängigkeit zum Ausdruck. Ich kreiere etwas, das Freude macht und anderen gut tut.",
                "textGoals": "Ich möchte mit meiner Arbeit anderen Menschen helfen, digitale Werkzeuge nutzen zu können. Mein Ziel ist es, Software zu entwickeln, die die Selbstständigkeit, Kreativität oder das ('let them cook') zu fördert.",
                "buttonAboutMe": "Ich bin Marcel",
                "buttonInterests": "Meine Interessen",
                "buttonGoals": "Meine Ziele"
        },

        "portfolio":{
                "prefixheadline": "Werf ein Blick auf mein",
                "text": "Eine Auswahl meiner Projekte, die meinen Weg sowie meine Leidenschaft für das Programmieren zeigt."
        },

        "projectOne": {
                "prefixheadline": "Schreib mir auf",
                "headline": "DABubble",
                "projectText": "DABubble ist eine Echtzeit-Chat-Webanwendung, die sich an Plattformen wie Slack oder Discord orientiert. Nutzer können Gruppen beitreten und gemeinsam in verschiedenen Channels chatten.\n\nMeine Hauptaufgabe in diesem Projekt war die Implementierung des gesamten Login-und Registrierungsprozesses. Dafür arbeitete ich intensiv mit Firebase und dessen umfangreicher Dokumentation. Das Ergebnis: Nutzer können sich entweder mit ihrem Google-Account anmelden oder einen eigenen Account registrieren - inklusive sicherer Datenverifizierung und Kommunikation über die Firebase API.\n\nIm Laufe des Projekts konnte ich außerdem mein Verständnis für Angular deutlich vertiefen. Besonders spannend war der Vergleich zwischen Template-driven Forms und Reactive Forms. Letztlich entschied ich mich für die Reactive-Form-Variante, da sie mehr Flexibilität bietet – etwa beim Einbinden eigener Validatoren und beim Umgang mit asynchronen Daten.\n\nZum Abschluss habe ich die Benutzererfahrung noch durch fließende Animationen verfeinert. Beim Navigieren durch den Anmeldeprozess bewegen sich die Fenster sanft in die jeweilige Richtung, was den Ablauf für den Nutzer natürlicher und angenehmer wirken lässt.",
                "moreButton": "erfahre mehr...",
                "picture": "./assets/projects/project_three.jpg",
                "pictureSmall": "./assets/projects/project_three-mobil.jpg",
                "colorHSL": [30, 87, 60],
                "technology": ["angular", "firebase", "sass"],
                "demoLink": "https://arndt-marcel.de/dabubble",
                "gitHubLink": "https://github.com/MarcelArndt/DABubble"
        },
        
        "projectTwo": {
                "prefixheadline": "Verwalte Aufgaben in",
                "headline": "Join",
                "projectText": "Join ist ein selbst entwickeltes Kanban-Board-System, mit dem sich Aufgaben und Kontakte effizient verwalten lassen. Das Projekt wurde vollständig in Vanilla JavaScript umgesetzt. Ohne Frameworks oder Bibliotheken und war für mich eine meiner bisher größten Herausforderungen.\n\nMeine Hauptaufgabe bestand darin, das Board selbst zu entwickeln, inklusive der Darstellung, der Interaktionslogik und der Datenverarbeitung. Überraschenderweise waren nicht die Drag-and-Drop- oder Touch-Funktionen die schwierigsten Teile, sondern vielmehr das aktualisieren der Benutzeroberfläche und der Umgang mit asynchronen Daten. Oft war es sprichwörtlich die „Nadel im Heuhaufen“, um den entscheidenden Fehler zu finden.\n\nOptisch zählt Join bis heute zu meinen Lieblingsprojekten. Nicht nur wegen des klaren Designs, sondern auch, weil es eines meiner ersten großen Softwareprojekte war. Dadurch verbinde ich mit ihm eine besondere persönliche Bedeutung und viele lehrreiche Momente.",
                "moreButton": "erfahre mehr...",
                "picture": "./assets/projects/project_two.jpg",
                "pictureSmall": "./assets/projects/project_two-mobil.jpg",
                "colorHSL": [230, 93, 60],
                "technology": ["javascript", "html", "css"],
                "demoLink": "https://arndt-marcel.de/join/",
                "gitHubLink": "https://github.com/MarcelArndt/Project-Join"
        },

        "projectThree": {
                "prefixheadline": "Watch it first on",
                "headline": "Videoflix",
                "projectText": "Videoflix ist ein Streamingdienst- oder Mediathek-Klon, der ähnlich wie Netflix oder Jellyfin ist. Als Benutzer kann man nicht nur eigene Videos ansehen und streamen, sondern sie auch direkt über die Weboberfläche hochladen. Der Server konvertiert die Dateien anschließend automatisch in ein streambares Format. Mir war es wichtig, dass die Plattform komplett über das Frontend bedienbar ist, ohne dass man Inhalte manuell im Backend einpflegen muss.\n\nDoch der Weg dahin war alles andere als einfach.\nVideoflix hat mich vor zahlreiche Herausforderungen gestellt, vom effizienten Management großer Datenmengen in PostgreSQL, über die Integration von Simple JWT und HTTPS-Cookies, bis hin zum Eintauchen in die tiefen Gewässer von Django.Es war eine intensive, manchmal frustrierende, aber unglaublich lehrreiche Erfahrung und spannender als jede Doku über den Marianengraben.\n\nAm Ende ist daraus ein Projekt geworden, das fast schon filmreif ist:\nIch konnte Docker für das Deployment einsetzen, Redis für Caching integrieren, eine Benutzerauthentifizierung umsetzen und viele neue Technologien praxisnah anwenden.",
                "moreButton": "erfahre mehr...",
                "picture": "./assets/projects/project_one.jpg",
                "pictureSmall": "./assets/projects/project_one-mobil.jpg",
                "colorHSL": [270, 85, 60],
                "technology": ["python", "django", "docker"],
                "demoLink": "https://arndt-marcel.de/da_videoflix/",
                "gitHubLink": "https://github.com/MarcelArndt/DAVideoflix"
        }
}